Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAML21J17A.xml
          <instance name="SERCOM2">
            <register-group name="SERCOM2" name-in-module="SERCOM" address-space="base" offset="0x42000800"/>
            <signals>
              <signal group="PAD" index="0" function="D" pad="PA08"/>
              <signal group="PAD" index="0" function="C" pad="PA12"/>
              <signal group="PAD" index="1" function="D" pad="PA09"/>
              <signal group="PAD" index="1" function="C" pad="PA13"/>
              <signal group="PAD" index="2" function="D" pad="PA10"/>
              <signal group="PAD" index="2" function="C" pad="PA14"/>
              <signal group="PAD" index="3" function="D" pad="PA11"/>
              <signal group="PAD" index="3" function="C" pad="PA15"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="5"/>
              <param name="DMAC_ID_TX" value="6"/>
              <param name="INT_MSB" value="6"/>
              <param name="PMSB" value="3"/>
            </parameters>
          </instance>
          <instance name="SERCOM3">
            <register-group name="SERCOM3" name-in-module="SERCOM" address-space="base" offset="0x42000C00"/>
            <signals>
              <signal group="PAD" index="0" function="D" pad="PA16"/>
              <signal group="PAD" index="0" function="C" pad="PA22"/>
              <signal group="PAD" index="0" function="F_RF233" pad="PA27"/>
              <signal group="PAD" index="1" function="D" pad="PA17"/>
              <signal group="PAD" index="1" function="C" pad="PA23"/>
              <signal group="PAD" index="2" function="D" pad="PA18"/>
              <signal group="PAD" index="2" function="D" pad="PA20"/>
              <signal group="PAD" index="2" function="C" pad="PA24"/>
              <signal group="PAD" index="3" function="D" pad="PA19"/>
              <signal group="PAD" index="3" function="D" pad="PA21"/>
              <signal group="PAD" index="3" function="C" pad="PA25"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="7"/>
              <param name="DMAC_ID_TX" value="8"/>
              <param name="INT_MSB" value="6"/>
              <param name="PMSB" value="3"/>
            </parameters>
          </instance>
          <instance name="SERCOM4">
            <register-group name="SERCOM4" name-in-module="SERCOM" address-space="base" offset="0x42001000"/>
            <signals>
              <signal group="PAD" index="0" function="D" pad="PA12"/>
              <signal group="PAD" index="0" function="D" pad="PB08"/>
              <signal group="PAD" index="0" function="C" pad="PB12"/>
              <signal group="PAD" index="1" function="D" pad="PA13"/>
              <signal group="PAD" index="1" function="D" pad="PB09"/>
              <signal group="PAD" index="1" function="C" pad="PB13"/>
              <signal group="PAD" index="1" function="F_RF233" pad="PB31"/>
              <signal group="PAD" index="2" function="D" pad="PA14"/>
              <signal group="PAD" index="2" function="D" pad="PB10"/>
              <signal group="PAD" index="2" function="C" pad="PB14"/>
              <signal group="PAD" index="2" function="F_RF233" pad="PB30"/>
              <signal group="PAD" index="3" function="D" pad="PA15"/>
              <signal group="PAD" index="3" function="D" pad="PB11"/>
              <signal group="PAD" index="3" function="C" pad="PB15"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="9"/>
              <param name="DMAC_ID_TX" value="10"/>
              <param name="INT_MSB" value="6"/>
              <param name="PMSB" value="3"/>
            </parameters>
          </instance>
          <instance name="SERCOM5">
            <register-group name="SERCOM5" name-in-module="SERCOM" address-space="base" offset="0x43000400"/>
            <signals>
              <signal group="PAD" index="0" function="D" pad="PA22"/>
              <signal group="PAD" index="0" function="D" pad="PB02"/>
              <signal group="PAD" index="0" function="D" pad="PB30"/>
              <signal group="PAD" index="0" function="C" pad="PB16"/>
              <signal group="PAD" index="1" function="D" pad="PA23"/>
              <signal group="PAD" index="1" function="D" pad="PB03"/>
              <signal group="PAD" index="1" function="D" pad="PB31"/>
              <signal group="PAD" index="1" function="C" pad="PB17"/>
              <signal group="PAD" index="2" function="D" pad="PA24"/>
              <signal group="PAD" index="2" function="D" pad="PB00"/>
              <signal group="PAD" index="2" function="D" pad="PB22"/>
              <signal group="PAD" index="2" function="C" pad="PA20"/>
              <signal group="PAD" index="3" function="D" pad="PA25"/>
              <signal group="PAD" index="3" function="D" pad="PB01"/>
              <signal group="PAD" index="3" function="D" pad="PB23"/>
              <signal group="PAD" index="3" function="C" pad="PA21"/>
            </signals>
            <parameters>
              <param name="INT_MSB" value="3"/>
              <param name="PMSB" value="3"/>
            </parameters>
          </instance>
        </module>
        <module name="SUPC" id="U2117" version="1.1.0">
          <instance name="SUPC">
            <register-group name="SUPC" name-in-module="SUPC" address-space="base" offset="0x40001400"/>
            <signals>
              <signal group="APWS_BOOST" function="APWS_TEST" pad="PB12"/>
              <signal group="APWS_CTRL" function="APWS_TEST" pad="PB15"/>
              <signal group="APWS_EN" function="APWS_TEST" pad="PB10"/>
              <signal group="APWS_READY" function="APWS_TEST" pad="PB14"/>
              <signal group="APWS_VSWOUT" function="APWS_TEST" pad="PB11"/>
              <signal group="BGBUFREADY" index="0" function="VREG_VREF_OBS" pad="PA08"/>
              <signal group="BGBUFREADY" index="1" function="VREG_VREF_OBS" pad="PA09"/>
              <signal group="BGBUFREADY" index="2" function="VREG_VREF_OBS" pad="PA10"/>
              <signal group="BGBUFREADY" index="3" function="VREG_VREF_OBS" pad="PA11"/>
              <signal group="BGBUFREADY" index="4" function="VREG_VREF_OBS" pad="PA12"/>
              <signal group="BIASREADY" function="VREG_VREF_OBS" pad="PB11"/>
              <signal group="BIAS_TEST_OUT" function="VREG_VREF_OBS" pad="PA06"/>
              <signal group="BUCK_BIAS" function="VREG_VREF_OBS" pad="PA02"/>
              <signal group="BUCK_COMPCLKOUT" function="VREG_VREF_OBS" pad="PA20"/>
              <signal group="BUCK_ILMAX" function="VREG_VREF_OBS" pad="PA22"/>
              <signal group="BUCK_IZERO" function="VREG_VREF_OBS" pad="PA23"/>
              <signal group="BUCK_OFFREADY" function="VREG_VREF_OBS" pad="PB17"/>
              <signal group="BUCK_PWM" function="VREG_VREF_OBS" pad="PB10"/>
              <signal group="BUCK_READY" function="VREG_VREF_OBS" pad="PA17"/>
              <signal group="LDO_READY" function="VREG_VREF_OBS" pad="PB30"/>
              <signal group="OUT" index="0" function="H" pad="PB01"/>
              <signal group="OUT" index="1" function="H" pad="PB02"/>
              <signal group="PSOK" function="H" pad="PB00"/>
              <signal group="SCVREG_CURSRCON" function="VREG_VREF_OBS" pad="PA04"/>
              <signal group="SCVREG_READY" function="VREG_VREF_OBS" pad="PA19"/>
              <signal group="VBAT" function="H" pad="PB03"/>
              <signal group="VREFREADY" index="0" function="VREG_VREF_OBS" pad="PB01"/>
              <signal group="VREFREADY" index="1" function="VREG_VREF_OBS" pad="PA03"/>
              <signal group="VREFREADY" index="2" function="VREG_VREF_OBS" pad="PB31"/>
              <signal group="VREF_ANA_OUT" function="VREG_VREF_OBS" pad="PA05"/>
            </signals>
            <parameters>
              <param name="BOD12_CALIB_MSB" value="5"/>
              <param name="BOD33_CALIB_MSB" value="5"/>
              <param name="SUPC_OUT_NUM_MSB" value="1"/>
            </parameters>
          </instance>
        </module>
        <module name="TAL" id="U2253" version="1.0.2">
          <instance name="TAL">
            <register-group name="TAL" name-in-module="TAL" address-space="base" offset="0x40002C00"/>
            <signals>
              <signal group="BRK" function="G" pad="PA27"/>
            </signals>
            <parameters>
              <param name="CPU_NUM" value="2"/>
              <param name="CTI_NUM" value="4"/>
              <param name="DMA_CH_NUM" value="16"/>
              <param name="EV_CH_NUM" value="12"/>
              <param name="EXTINT_NUM" value="16"/>
              <param name="INT_NUM" value="29"/>
            </parameters>
          </instance>
        </module>
        <module name="TC" id="U2249" version="2.0.0">
          <instance name="TC0">
            <register-group name="TC0" name-in-module="TC" address-space="base" offset="0x42002000"/>
            <signals>
              <signal group="WO" index="0" function="E" pad="PA22"/>
              <signal group="WO" index="0" function="E" pad="PB08"/>
              <signal group="WO" index="0" function="E" pad="PB12"/>
              <signal group="WO" index="1" function="E" pad="PA23"/>
              <signal group="WO" index="1" function="E" pad="PB09"/>
              <signal group="WO" index="1" function="E" pad="PB13"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="2"/>
              <param name="DMAC_ID_OVF" value="22"/>
              <param name="EXT" value="0"/>
              <param name="MASTER" value="1"/>
              <param name="OW_NUM" value="2"/>
            </parameters>
          </instance>
          <instance name="TC1">
            <register-group name="TC1" name-in-module="TC" address-space="base" offset="0x42002400"/>
            <signals>
              <signal group="WO" index="0" function="E" pad="PA24"/>
              <signal group="WO" index="0" function="E" pad="PB10"/>
              <signal group="WO" index="0" function="E" pad="PB14"/>
              <signal group="WO" index="1" function="E" pad="PA25"/>
              <signal group="WO" index="1" function="E" pad="PB11"/>
              <signal group="WO" index="1" function="E" pad="PB15"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="2"/>
              <param name="DMAC_ID_OVF" value="25"/>
              <param name="EXT" value="0"/>
              <param name="MASTER" value="0"/>
              <param name="OW_NUM" value="2"/>
            </parameters>
          </instance>
          <instance name="TC2">
            <register-group name="TC2" name-in-module="TC" address-space="base" offset="0x42002800"/>
            <signals>
              <signal group="WO" index="0" function="E" pad="PB02"/>
              <signal group="WO" index="0" function="E" pad="PB16"/>
              <signal group="WO" index="1" function="E" pad="PB03"/>
              <signal group="WO" index="1" function="E" pad="PB17"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="2"/>
              <param name="DMAC_ID_OVF" value="28"/>
              <param name="EXT" value="0"/>
              <param name="MASTER" value="1"/>
              <param name="OW_NUM" value="2"/>
            </parameters>
          </instance>
          <instance name="TC3">
            <register-group name="TC3" name-in-module="TC" address-space="base" offset="0x42002C00"/>
            <signals>
              <signal group="WO" index="0" function="E" pad="PA20"/>
              <signal group="WO" index="0" function="E" pad="PB00"/>
              <signal group="WO" index="0" function="E" pad="PB22"/>
              <signal group="WO" index="1" function="E" pad="PA21"/>
              <signal group="WO" index="1" function="E" pad="PB01"/>
              <signal group="WO" index="1" function="E" pad="PB23"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="2"/>
              <param name="DMAC_ID_OVF" value="31"/>
              <param name="EXT" value="0"/>
              <param name="MASTER" value="0"/>
              <param name="OW_NUM" value="2"/>
            </parameters>
          </instance>
