Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAML21J17A.xml
        <register name="INTFLAG" offset="0x14" rw="RW" size="1" initval="0x00" caption="Interrupt Flag Status and Clear">
          <bitfield name="READY" caption="NVM Ready" mask="0x1"/>
          <bitfield name="ERROR" caption="Error" mask="0x2"/>
        </register>
        <register name="STATUS" offset="0x18" rw="RW" size="2" initval="0x0000" caption="Status">
          <bitfield name="PRM" caption="Power Reduction Mode" mask="0x1"/>
          <bitfield name="LOAD" caption="NVM Page Buffer Active Loading" mask="0x2"/>
          <bitfield name="PROGE" caption="Programming Error Status" mask="0x4"/>
          <bitfield name="LOCKE" caption="Lock Error Status" mask="0x8"/>
          <bitfield name="NVME" caption="NVM Error" mask="0x10"/>
          <bitfield name="SB" caption="Security Bit Status" mask="0x100"/>
        </register>
        <register name="ADDR" offset="0x1C" rw="RW" size="4" initval="0x00000000" caption="Address">
          <bitfield name="ADDR" caption="NVM Address" mask="0x3FFFFF"/>
        </register>
        <register name="LOCK" offset="0x20" rw="RW" size="2" caption="Lock Section">
          <bitfield name="LOCK" caption="Region Lock Bits" mask="0xFFFF"/>
        </register>
      </register-group>
      <value-group name="NVMCTRL_CTRLA__CMD">
        <value name="ER" caption="Erase Row - Erases the row addressed by the ADDR register." value="0x02"/>
        <value name="WP" caption="Write Page - Writes the contents of the page buffer to the page addressed by the ADDR register." value="0x04"/>
        <value name="EAR" caption="Erase Auxiliary Row - Erases the auxiliary row addressed by the ADDR register. This command can be given only when the security bit is not set and only to the user configuration row." value="0x05"/>
        <value name="WAP" caption="Write Auxiliary Page - Writes the contents of the page buffer to the page addressed by the ADDR register. This command can be given only when the security bit is not set and only to the user configuration row." value="0x06"/>
        <value name="SF" caption="Security Flow Command" value="0x0A"/>
        <value name="WL" caption="Write lockbits" value="0x0F"/>
        <value name="RWWEEER" caption="RWW EEPROM area Erase Row - Erases the row addressed by the ADDR register." value="0x1A"/>
        <value name="RWWEEWP" caption="RWW EEPROM Write Page - Writes the contents of the page buffer to the page addressed by the ADDR register." value="0x1C"/>
        <value name="LR" caption="Lock Region - Locks the region containing the address location in the ADDR register." value="0x40"/>
        <value name="UR" caption="Unlock Region - Unlocks the region containing the address location in the ADDR register." value="0x41"/>
        <value name="SPRM" caption="Sets the power reduction mode." value="0x42"/>
        <value name="CPRM" caption="Clears the power reduction mode." value="0x43"/>
        <value name="PBC" caption="Page Buffer Clear - Clears the page buffer." value="0x44"/>
        <value name="SSB" caption="Set Security Bit - Sets the security bit by writing 0x00 to the first byte in the lockbit row." value="0x45"/>
        <value name="INVALL" caption="Invalidate all cache lines." value="0x46"/>
      </value-group>
      <value-group name="NVMCTRL_CTRLA__CMDEX">
        <value name="KEY" caption="Execution Key" value="0xA5"/>
      </value-group>
      <value-group name="NVMCTRL_CTRLB__READMODE">
        <value name="NO_MISS_PENALTY" caption="The NVM Controller (cache system) does not insert wait states on a cache miss. Gives the best system performance." value="0x0"/>
        <value name="LOW_POWER" caption="Reduces power consumption of the cache system, but inserts a wait state each time there is a cache miss. This mode may not be relevant if CPU performance is required, as the application will be stalled and may lead to increase run time." value="0x1"/>
        <value name="DETERMINISTIC" caption="The cache system ensures that a cache hit or miss takes the same amount of time, determined by the number of programmed flash wait states. This mode can be used for real-time applications that require deterministic execution timings." value="0x2"/>
      </value-group>
      <value-group name="NVMCTRL_CTRLB__RWS">
        <value name="SINGLE" caption="Single Auto Wait State" value="0"/>
        <value name="HALF" caption="Half Auto Wait State" value="1"/>
        <value name="DUAL" caption="Dual Auto Wait State" value="2"/>
      </value-group>
      <value-group name="NVMCTRL_CTRLB__SLEEPPRM">
        <value name="WAKEONACCESS" caption="NVM block enters low-power mode when entering sleep.NVM block exits low-power mode upon first access." value="0"/>
        <value name="WAKEUPINSTANT" caption="NVM block enters low-power mode when entering sleep.NVM block exits low-power mode when exiting sleep." value="1"/>
        <value name="DISABLED" caption="Auto power reduction disabled." value="3"/>
      </value-group>
      <value-group name="NVMCTRL_PARAM__PSZ">
        <value name="8" caption="8 bytes" value="0x0"/>
        <value name="16" caption="16 bytes" value="0x1"/>
        <value name="32" caption="32 bytes" value="0x2"/>
        <value name="64" caption="64 bytes" value="0x3"/>
        <value name="128" caption="128 bytes" value="0x4"/>
        <value name="256" caption="256 bytes" value="0x5"/>
        <value name="512" caption="512 bytes" value="0x6"/>
        <value name="1024" caption="1024 bytes" value="0x7"/>
      </value-group>
    </module>
    <module name="FUSES" id="U2207" version="3.0.2" caption="Non-Volatile Fuses">
      <register-group name="OTP1_FUSES">
        <register name="OTP1_WORD_0" offset="0x0" size="4" rw="RW" initval="0xFFFFFFFF" caption="OTP1 Page Word 0">
          <bitfield name="NVMCTRL_NVM_LOCK" caption="NVM Lock" mask="0xFF"/>
          <bitfield name="NVMCTRL_PSZ" caption="NVM Page Size" mask="0x300"/>
          <bitfield name="NVMCTRL_NVMP" caption="Number of NVM Pages" mask="0x1FFF0000"/>
        </register>
        <register name="OTP1_WORD_1" offset="0x4" size="4" rw="RW" initval="0xFFFFFFFF" caption="OTP1 Page Word 1">
          <bitfield name="NVMCTRL_RWWEEP" caption="Number of RWW EEPROM Pages" mask="0xFF"/>
        </register>
      </register-group>
      <register-group name="OTP5_FUSES">
        <register name="OTP5_WORD_0" offset="0x0" size="4" rw="RW" initval="0xFFFFFFFF" caption="OTP5 Page Word 0">
          <bitfield name="ADC_BIASREFBUF" caption="ADC Bias Reference Buffer Scaling" mask="0x7"/>
          <bitfield name="ADC_BIASCOMP" caption="ADC Comparator Scaling" mask="0x38"/>
          <bitfield name="USB_TRANSN" caption="USB pad Transn calibration" mask="0x3E000"/>
          <bitfield name="USB_TRANSP" caption="USB pad Transp calibration" mask="0x7C0000"/>
          <bitfield name="USB_TRIM" caption="USB pad Trim calibration" mask="0x3800000"/>
        </register>
      </register-group>
      <register-group name="TEMP_LOG_FUSES">
        <register name="TEMP_LOG_WORD_0" offset="0x0" size="4" rw="RW" initval="0xFFFFFFFF" caption="TEMP_LOG Page Word 0">
          <bitfield name="ROOM_TEMP_VAL_INT" caption="Integer part of room temperature in oC" mask="0xFF"/>
          <bitfield name="ROOM_TEMP_VAL_DEC" caption="Decimal part of room temperature" mask="0xF00"/>
          <bitfield name="HOT_TEMP_VAL_INT" caption="Integer part of hot temperature in oC" mask="0xFF000"/>
          <bitfield name="HOT_TEMP_VAL_DEC" caption="Decimal part of hot temperature" mask="0xF00000"/>
          <bitfield name="ROOM_INT1V_VAL" caption="2's complement of the internal 1V reference drift at room temperature (versus a 1.0 centered value)" mask="0xFF000000"/>
        </register>
        <register name="TEMP_LOG_WORD_1" offset="0x4" size="4" rw="RW" initval="0xFFFFFFFF" caption="TEMP_LOG Page Word 1">
          <bitfield name="HOT_INT1V_VAL" caption="2's complement of the internal 1V reference drift at hot temperature (versus a 1.0 centered value)" mask="0xFF"/>
          <bitfield name="ROOM_ADC_VAL" caption="12-bit ADC conversion at room temperature" mask="0xFFF00"/>
          <bitfield name="HOT_ADC_VAL" caption="12-bit ADC conversion at hot temperature" mask="0xFFF00000"/>
        </register>
      </register-group>
      <register-group name="USER_FUSES">
        <register name="USER_WORD_0" offset="0x0" size="4" rw="RW" initval="0xFFFFFFFF" caption="USER Page Word 0">
          <bitfield name="NVMCTRL_BOOTPROT" caption="Bootloader Size" mask="0x7"/>
          <bitfield name="NVMCTRL_EEPROM_SIZE" caption="EEPROM Size" mask="0x70"/>
          <bitfield name="BOD33USERLEVEL" caption="BOD33 User Level" mask="0x3F00"/>
          <bitfield name="BOD33_EN" caption="BOD33 Enable" mask="0x4000"/>
          <bitfield name="BOD33_ACTION" caption="BOD33 Action" mask="0x18000"/>
          <bitfield name="BOD12_EN" caption="BOD12 Enable" mask="0x800000"/>
          <bitfield name="WDT_ENABLE" caption="WDT Enable" mask="0x4000000"/>
          <bitfield name="WDT_ALWAYSON" caption="WDT Always On" mask="0x8000000"/>
          <bitfield name="WDT_PER" caption="WDT Period" mask="0xF0000000"/>
        </register>
